[Rainmeter]
Update=-1
AccurateText=0
DynamicWindowSize=0
Group=PRTSkin | PRTSkinHidable

[Metadata]
Name=Rhodes_Island_UI
Author=热心炎国云玩家
Information=让您在PC上也能享受到罗德岛终端系统的交互界面。|单按钮，真是来之不易的一键即达。
License=Closure Commons 署名-不许获利-传递下去 42.0
Version=0.10.0

[Variables]
@Include1=#@#GlobalVars.inc


[Operator1M1]
Meter=Image
MeasureName=MMOperator1Shadow


;"砰！哈哈哈——"
[Operator1]
Meter=Image
MeterStyle=styColor1 | BtnAni
X=#OperatorX#
Y=#OperatorY#
W=370
H=150
LeftMouseUpAction=#RelsAct##Operator1Action#

[Operator1Dots]
Meter=Image
MeterStyle=Operator1
ImageName=#@#Images\BtnDot.png
LeftMouseUpAction=

[Operator1.Bk]
Meter=Image
MeterStyle=Operator1
Group=AniBlackFade
LeftMouseUpAction=

[Operator1Icon]
Meter=Image
ImageName=#Operator1Icon#
ImageTint=#PrimaryIconColor#,#PrimaryIconOpacity#
X=([Operator1:X]+210)
Y=([Operator1:H]*0.08+[Operator1:Y])
W=([Operator1:H]*0.84)
H=([Operator1:H]*0.84)

[Operator1Title]
Meter=String
MeterStyle=styFontTitle
FontSize=50
Text=#Operator1Title#
X=([Operator1:X]+16)
Y=([Operator1:Y]+62)

[Operator1TextDesc]
Meter=String
MeterStyle=styFontText
FontColor=#PrimaryFGColor#,79
FontSize=24
Text=#Operator1Desc#
X=8r
Y=47r